import { Component } from '@angular/core';
import { PrivacySection } from 'src/app/models/content.model';

@Component({
  selector: 'app-privacy-policy',
  templateUrl: './privacy-policy.component.html',
  styleUrls: ['./privacy-policy.component.css']
})
export class PrivacyPolicyComponent {
  sections: PrivacySection[] = [
    {
      id: 'section1',
      title: 'جمع المعلومات',
      content: `نقوم بجمع بعض البيانات الشخصية عندما تقوم بالتسجيل أو استخدام خدماتنا، يشمل ذلك اسمك، عنوان بريدك الإلكتروني، معلومات الدفع (إذا كانت مطلوبة)، وبيانات الاستخدام مثل تفضيلاتك أثناء استخدام الموقع.`
    },
    {
      id: 'section2',
      title: 'استخدام البيانات',
      content: `تُستخدم البيانات التي نجمعها لتحسين تجربتك وتقديم خدماتنا بأعلى مستوى ممكن، ونستخدم بياناتك أيضًا للاتصال بك، تحسين خدماتنا، وإرسال التحديثات المتعلقة بالخدمات التي تستخدمها.`
    },
    {
      id: 'section3',
      title: 'ملفات تعريف الارتباط (Cookies)',
      content: `يستخدم موقعنا ملفات تعريف الارتباط (Cookies) لتحسين تجربتك وتخصيص المحتوى الذي نقدمه. ملفات تعريف الارتباط هي ملفات صغيرة تُخزن على جهازك لجمع بيانات حول تفاعلك مع موقعنا. تشمل أنواع ملفات تعريف الارتباط التي نستخدمها:`,
      listItems: [
        'ملفات الأداء: تُستخدم لمراقبة وتحسين أداء الموقع.',
        'ملفات الوظيفية: تُستخدم لتخصيص تجربتك بناءً على تفضيلاتك.',
        'ملفات تحليلية: تساعد في تحليل البيانات وتحسين استراتيجيات التسويق.',
        'يمكنك إدارة تفضيلات ملفات تعريف الارتباط عبر إعدادات متصفحك أو من خلال اللافتات التي تظهر على موقعنا.'
      ]
    },
    {
      id: 'section4',
      title: 'إشعار الاختراقات الأمنية',
      content: `في حال حدوث أي خرق أمني يؤدي إلى تسريب بياناتك الشخصية، سنقوم بإخطارك فور اكتشافنا للخرق، وسنتخذ الإجراءات اللازمة لحماية بياناتك وإصلاح الثغرات بالتعاون مع السلطات المختصة، إذا لزم الأمر.`
    },
    {
      id: 'section5',
      title: 'حماية بيانات الأطفال',
      content: `نحن لا نقوم بجمع بيانات الأطفال تحت سن 13 (أو 16 حسب القوانين المحلية) دون موافقة الوالدين أو الأوصياء، وإذا اكتشفنا أننا جمعنا بيانات من قاصر دون موافقة الأوصياء، سنقوم بحذفها على الفور.`
    },
    {
      id: 'section6',
      title: 'معلومات التواصل والشكاوى',
      content: `يمكن التواصل معنا من خلال الايميل التالي، في حالة وجود استفسار: support@ugitec.com`
    },
    {
      id: 'section7',
      title: 'إمكانية الوصول والتحكم في البيانات (حق الوصول)',
      content: `يمكن طلب الوصول إلى بياناتك الشخصية في أي وقت، مع أمكانية تحديثها أو تصحيحها إذا كان بها بيانات غير دقيقة، وكما يمكنك إلغاء الاشتراك في الرسائل التسويقية أو الحملات الدعائية.`
    },
    {
      id: 'section8',
      title: 'الامتثال للقوانين المحلية والدولية',
      content: `فيما يخص حماية البيانات والمعلومات، تنتهج يوحيتك سياسة متوافقة مع التشريعات المحلية والدولية، مثل:`,
      listItems: [
        'اللائحة العامة لحماية البيانات (GDPR).',
        'قانون حماية البيانات الشخصية المصري.',
        'قوانين حماية الخصوصية في دول الخليج مثل الإمارات أو السعودية.'
      ]
    },
    {
      id: 'section9',
      title: 'مقدمو الخدمات الخارجيون (Third-Party Services)',
      content: `نحن نستخدم مزودي خدمات خارجيين لأغراض مثل الدفع الإلكتروني، التحليلات، أو الاستضافة. نحن نضمن أن جميع مزودي الخدمات هؤلاء ملتزمون بمعايير حماية البيانات.`
    },
    {
      id: 'section10',
      title: 'تحليلات البيانات (Analytics)',
      content: `نستخدم خدمات مثل Google Analytics لجمع معلومات حول استخدامك للموقع، بما في ذلك الصفحات التي تزورها وكيفية تفاعلك مع المحتوى.`
    },
    {
      id: 'section11',
      title: 'نقل البيانات إلى الخارج',
      content: `قد نقوم بنقل بياناتك وتخزينها في خوادم تقع خارج مصر ودول الخليج العربي. نحن نلتزم باتخاذ التدابير اللازمة لضمان أن نقل البيانات الدولية يتوافق مع القوانين واللوائح المعمول بها لحماية البيانات.`
    },
    {
      id: 'section12',
      title: 'التحديثات والإشعارات',
      content: `نحتفظ بالحق في تحديث سياسة الخصوصية هذه من حين لآخر. سيتم إشعارك بأي تغييرات عبر البريد الإلكتروني أو من خلال إشعار على موقعنا، يرجى مراجعة هذه السياسة بشكل دوري للتأكد من موافقتك على أي تغييرات جديدة.`
    }
  ];
}
