import { Component } from '@angular/core';

@Component({
  selector: 'app-apps',
  templateUrl: './apps.component.html',
  styleUrls: ['./apps.component.css']
})
export class AppsComponent {
  tabsData = [
    { id: 1, titleKey: 'الإشعارات الفورية', descKey: 'تُمكن التطبيقات الشركات من التواصل مع العملاء مباشرة عبر الإشعارات، مما يساهم في تعزيز التفاعل وزيادة المشاركة الفعالة مع المستخدمين.', imageUrl: 'assets/images/app/الإشعارات-الفورية.jpg' },
    { id: 2, titleKey: 'البحث المتقدم', descKey: 'توفير خاصية البحث المتقدم مع خيارات تصفية متنوعة، مما يسهل على المستخدمين العثور على ما يبحثون عنه بسرعة.', imageUrl: 'assets/images/app/البحث-المتقدم.jpg' },
    { id: 3, titleKey: 'الأمان والخصوصية', descKey: 'توفير ميزات أمان قوية مثل التشفير والتحقق من الهوية، مما يمنح المستخدمين الثقة في استخدام التطبيق وتبادل معلوماتهم الشخصية', imageUrl: 'assets/images/app/الخصوصية-الأمان.jpg' },
  ];
  tabsMetadata = [
       { header: 'مميزات لا حصر لها في تطبيقات يوجيتك', paragraph: 'نستطيع أن حقق لك كل ما تحتاجه أو تفرضه طبيعة عملك، من أجل الحصول على تطبيق يلبي تطلعاتك وتطلعات عملائك. ' },
  ]
  dynamicSectionData = {
    headerKey: 'نبتكر تطبيقات فريدة تعزز',
    rotatingTextKeys: [
      'تواجدك الرقمي',
      'اكتسابك للعملاء',
      'أمانك الرقمي',
      'تفوقك التكنولوجي'
    ],
    staticTextKey: 'نوفر حلولًا مبتكرة وشاملة لتحويل الأفكار إلى تطبيقات مميزة تعمل على مختلف الأجهزة، مع ضمان تجربة مستخدم سلسة.',
    watchButtonKey: 'انشئ تطبيقك الآن',
    downloadButtonKey: 'شاهد فيديو',
    imageUrl: 'assets/images/app/عملاء-أكثر--مبيعات-أكثر.png'
  };
  
  featureTwoData = {
    headerKey: 'الراحة .. التخصيص..التواصل الفوري',
    descKey: 'مع تطبيقات يوجيتك يمكن للمستخدمين الوصول إلى الخدمات والمعلومات بسهولة من أي مكان وفي أي وقت، وتخصيص المحتوى بناء على احتياجاتهم، مما يعزز التجربة ويجعل التعامل مع الشركة أو العلامة التجارية أكثر سهولة وسلاسة، وذلك بجانب مميزات أخرى مثل',
    items: [
      { headerKey: 'تعدد اللغات مما يتيح لك الوصول للعملاء ', iconColor: '#d3a00f' },
      { headerKey: 'سهولة إتمام المعاملات المالية بطرق دفع متعددة وآمنة', iconColor: '#d3a00f' },
      { headerKey: 'يساعدك في تنفيذ برامج الولاء والعروض الحصرية لتعزيز ولاء العملاء.', iconColor: '#d3a00f' },
      { headerKey: 'يمكن للعميل التواصل مع الأقسام الداخلية للشركة بسهولة مثل الدعم الفني أو خدمة العملاء.', iconColor: '#d3a00f' },
     
    ],
    imageUrl: 'assets/images/app/الراحة---التخصيص-التواصل-الفوري.png'
  };
  
  
  featureThreeData = {
    headerKey: 'عملاء أكثر.. مبيعات أكثر',
    descKey: 'تساعد التطبيقات في زيادة مبيعات العلامة التجارية من المنتجات أو الخدمات، لأنها تساعد في توسيع قاعدة العملاء المستهدفة، وتجعلهم على اطلاع دائم بأحدث أخبار شركتك، وكما توفر مميزات أخرى كالتالي: ',
    items: [
      { headerKey: 'التكامل مع المنصات الأخرى', descKey: 'يمكن ربط التطبيق بمنصات السوشيال ميديا مثل الفيسبوك وانستا وسناب شات وغيرهم، بجانب التكامل مع الأنظمة المحاسبية والإدارية الأخرى.', icon: 'assets/images/app/الربط بالأنظمة الإدارية.svg' },
      { headerKey: 'الدفع أون لاين ', descKey: 'يمكن لعملائك تنفيذ عمليات الشراء بسرعة وبشكل أمان من خلال التطبيق، حيث نوفر لك جميع طرق الدفع التي تحتاجها سواء كانت فيزا أو محفظة إلكترونية .. الخ.', icon: 'assets/images/app/التكامل مع وسائل الدفع..svg' },
      { headerKey: 'تعدد طرق الشحن وتتبع البضاعة  ', descKey: 'يمكن لعملائك اختيار طريقة شحن المنتجات بعد شرائها، وتحديد مكان وموعد لاستلامها، بجانب ميزة تتبع الشحن التي تعزز التواصل الفعّال بين الشركة والعملاء، وتزيد من مستوى رضا المستخدمين من خلال الشفافية والكفاءة في إدارة الشحنات. ', icon: 'assets/images/app/زيادة الولاء للعلامة التجارية.svg' }
    ],
    imageUrl: 'assets/images/app/عملاء-أكثر--مبيعات-أكثر.png'
  };

  featureCards = [
    { icon: 'assets/images/app/الربط بالأنظمة الإدارية.svg', captionKey: 'الربط مع أنظمة يوجيتك الإدارية.' },
    { icon: 'assets/images/app/الوصول للعملاء.svg', captionKey: 'سهولة الوصول للعملاء.' },
    { icon: 'assets/images/app/تحسين تجربة المستخدم.svg', captionKey: 'تحسين تجربة المستخدم.' },
    { icon: 'assets/images/app/الاشعارات الفورية.svg', captionKey: 'تنبيهات وإشعارات فورية' },
    { icon: 'assets/images/app/مان المعلومات والبيانات الشخصية.svg', captionKey: 'أمان المعلومات والبيانات الشخصية.' },
    { icon: 'assets/images/app/التكامل مع وسائل الدفع..svg', captionKey: 'التكامل مع وسائل الدفع.' },
  ];
}
