import { Component } from '@angular/core';
import { usageSection } from 'src/app/models/content.model';

@Component({
  selector: 'app-usage-policy',
  templateUrl: './usage-policy.component.html',
  styleUrls: ['./usage-policy.component.css']
})
export class UsagePolicyComponent {
 sections: usageSection[] = [
    {
      id: 'section1',
      title: ' الترخيص',
      content: ` تمنحك "يوجيتك" ترخيصًا غير حصري وقابل للإلغاء لاستخدام الخدمة، مع التزامك بشروط معينة حول الاستخدام. يمكن لشركة "يوجيتك" تعليق أو إنهاء الوصول إلى الخدمة إذا تم اكتشاف استخدام غير قانوني أو غير مناسب.`
    },
    {
      id: 'section2',
      title: 'التغيرات في الخدمة',
      content: `تحتفظ "يوجيتك" بالحق في تعديل أو سحب الخدمة في أي وقت، وفقًا لتقديرها، دون إشعار مسبق.`
    },
   
    {
      id: 'section3',
      title: 'الدفع',
      content: `عند الاشتراك في الخدمة، يلتزم المستخدم بدفع الرسوم المحددة والتي قد تُجدد تلقائيًا. كما يجب على العميل تقديم معلومات دفع دقيقة لضمان استمرار الخدمة`
    },
    {
      id: 'section4',
      title: 'حماية البيانات ',
      content: `انت توافق على أن "يوجيتك" قد تخزن وتحلل بياناتك وفقًا للسياسات الخاصة بها، بما في ذلك سياسة الخصوصية التي قد تتغير من وقت لآخر`
    },
    {
      id: 'section5',
      title: 'الإلغاء',
      content: ` يمكن لـ "يوجيتك" إنهاء العلاقة معك في حال انتهاكك لأحد البنود، وستكون مسؤولاً عن أي خسائر أو تكاليف ناشئة عن ذلك.`
    },
    {
      id: 'section6',
      title: 'الامتثال القانوني',
      content: `يتعين على العميل الامتثال لجميع القوانين المعمول بها أثناء استخدام الخدمة، وعدم انتهاك حقوق الملكية الفكرية الخاصة بأي طرف ثالث.`,
     
    },
   
  ];
}
